package com.example.jobcentrebackend.enums;

public enum EducationLevel {
    Primary, // Начальное общее образование
    Basic, // Основное общее образование
    Secondary, // Среднее общее образование
    SecondaryProfessionalQualified, // Среднее профессиональное образование по программам подготовки квалифицированных рабочих (служащих)
    SecondaryProfessionalSpecialist, // Среднее профессиональное образование по программам подготовки специалистов среднего звена
    Bachelor, // Высшее образование – бакалавриат
    Master, // Высшее образование – специалитет или магистратура
    Postgraduate // Высшее образование – подготовка кадров высшей квалификации по программам подготовки научно-педагогических кадров в аспирантуре (адъюнктуре), по программам ординатуры, по программам ассистентуры-стажировки
}
